#language: ru
Функционал: Поиск курсов

  @search_course
  Сценарий: Поиск курса
    Пусть Открыта главная страница
    И Ищется курс "Специализация Android"

  @search_last_specialization
  Сценарий: Поиск самой поздней по дате специализации
    Пусть Открыта главная страница
    И Выбирается самая поздняя по дате специализация

  @search_first_specialization
  Сценарий: Поиск самой ранней по дате специализации
    Пусть Открыта главная страница
    И Выбирается самая ранняя по дате специализация